#include "Project.h"
#include "DllMain.h"
#include "Test.h"
#include "Unloader.h"
#include "Console.h"

#include <atlstr.h>
#include <d3d9.h>
#include <d3dx9.h>
#include <fstream>
#include <iomanip>
#include <Minhook.h>
#include <process.h>
#include <stdio.h>
#include <stdlib.h>
#include <string>
#include <time.h>
#include <vector>
#include <wchar.h>
#include <WinBase.h>
#include <Windows.h>
#include <windowsx.h>


#pragma comment(lib, "libMinHook.lib")
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")


using namespace std;

DLLEXPORT void Initialize();
DLLEXPORT void Run();
DLLEXPORT void Cleanup();
DLLEXPORT void __cdecl  hotkeyThread(void*);


BOOL WINAPI OnConsoleSignal(DWORD dwCtrlType);
DWORD pGlobalChainD3Device = NULL;
LPDIRECT3DDEVICE9 pD3dDevice;
D3DVIEWPORT9 d3dViewport;
LPD3DXFONT gFont;
LPD3DXFONT giFont;

HANDLE hHotkeyThread;
HRESULT GenerateTexture(IDirect3DDevice9 *pD3Ddev, IDirect3DTexture9 **ppD3Dtex, DWORD colour32);
bool InsertHook(void *pTarget, void *pDetour, void *pOriginal);
bool CreateDefaultFont();
void drawStuff();

// Pointer Math
#define ADDPTR(ptr, add) PVOID((PBYTE(ptr) + size_t(add)))
#define SUBPTR(ptr, add) PVOID((PBYTE(ptr) - size_t(add)))
#define DEREF(ptr, add, type) *static_cast<type*>(ADDPTR(ptr,add))

#define dx_endscene 0
#define dx_reset 1

#define ALIGN_TOP 1
#define ALIGN_LEFT 2
#define ALIGN_RIGHT 3
#define ALIGN_BOTTOM 4
#define ALIGN_CENTER 5

#define FONT_SIZE_1080 18
#define FONT_SIZE_720 18

HRESULT WINAPI hCreateVertexShader(LPDIRECT3DDEVICE9 pDevice, DWORD *pFunction, IDirect3DVertexShader9 **ppShader);
HRESULT WINAPI hDrawIndexedPrimitive(LPDIRECT3DDEVICE9 pDevice, D3DPRIMITIVETYPE Type, INT BaseVertexIndex, UINT MinIndex, UINT NumVertices, UINT StartIndex, UINT PrimitiveCount);
HRESULT WINAPI hDrawIndexedPrimitiveUP(LPDIRECT3DDEVICE9 pDevice, D3DPRIMITIVETYPE PrimitiveType, UINT MinVertexIndex, UINT NumVertices, UINT PrimitiveCount, void *pIndexData, D3DFORMAT IndexDataFormat, void *pVertexStreamZeroData, UINT VertexStreamZeroStride);
HRESULT WINAPI hDrawPrimitive(LPDIRECT3DDEVICE9 pDevice, D3DPRIMITIVETYPE pPrimativeType, UINT startVertex, UINT primitiveCount);
HRESULT WINAPI hDrawPrimitiveUP(LPDIRECT3DDEVICE9 pDevice, D3DPRIMITIVETYPE pPrimitiveType, UINT primitiveCount, void *pVertexStreamZeroData, UINT VertexStreamZeroStride);
HRESULT WINAPI hEndScene(LPDIRECT3DDEVICE9 pDevice);
HRESULT WINAPI hGetLight(LPDIRECT3DDEVICE9 pDevice, DWORD Index, D3DLIGHT9 *pLight);
HRESULT WINAPI hGetStreamSource(LPDIRECT3DDEVICE9 pDevice, UINT StreamNumber, IDirect3DVertexBuffer9 **ppStreamData, UINT *pOffsetInBytes, UINT *pStride);
HRESULT WINAPI hLightEnable(LPDIRECT3DDEVICE9 pDevice, DWORD LightIndex, BOOL bEnable);
HRESULT WINAPI hProcessVertices(LPDIRECT3DDEVICE9 pDevice, UINT SrcStartIndex, UINT DestIndex, UINT VertexCount, IDirect3DVertexBuffer9 *pDestBuffer, IDirect3DVertexDeclaration9 *pVertexDecl, DWORD Flags);
HRESULT WINAPI hReset(LPDIRECT3DDEVICE9 pDevice, D3DPRESENT_PARAMETERS *pPresentationParameters);
HRESULT WINAPI hSetLight(LPDIRECT3DDEVICE9 pDevice, DWORD Index, D3DLIGHT9 *pLight);
HRESULT WINAPI hSetMaterial(LPDIRECT3DDEVICE9 pDevice, D3DMATERIAL9 *pMaterial);
HRESULT WINAPI hSetRenderState(LPDIRECT3DDEVICE9 pDevice, D3DRENDERSTATETYPE pState, DWORD value);
HRESULT WINAPI hSetStreamSource(LPDIRECT3DDEVICE9 pDevice, UINT StreamNumber, IDirect3DVertexBuffer9 *pStreamData, UINT OffsetInBytes, UINT Stride);
HRESULT WINAPI hSetTexture(LPDIRECT3DDEVICE9 pDevice, DWORD Sampler, IDirect3DBaseTexture9 *pTexture);
HRESULT WINAPI hSetViewport(LPDIRECT3DDEVICE9 pDevice, D3DVIEWPORT9 *pViewport);

tBeginScene oBeginScene = NULL;
tColorFill oColorFill = NULL;
tCreateIndexBuffer oCreateIndexBuffer = NULL;
tCreateRenderTarget oCreateRenderTarget = NULL;
tCreateTexture oCreateTexture = NULL;
tCreateVertexBuffer oCreateVertexBuffer = NULL;
tCreateVertexShader oCreateVertexShader = NULL;
tDrawIndexedPrimitive oDrawIndexedPrimitive = NULL;
tDrawIndexedPrimitiveUP oDrawIndexedPrimitiveUP = NULL;
tDrawPrimitive oDrawPrimitive = NULL;
tDrawPrimitiveUP oDrawPrimitiveUP = NULL;
tEndScene oEndScene = NULL;
tGetLight oGetLight = NULL;
tGetStreamSource oGetStreamSource = NULL;
tLightEnable oLightEnable = NULL;
tProcessVertices oProcessVertices = NULL;
tReset oReset = NULL;
tSetLight oSetLight = NULL;
tSetMaterial oSetMaterial = NULL;
tSetRenderState oSetRenderState = NULL;
tSetStreamSource oSetStreamSource = NULL;
tSetTexture oSetTexture = NULL;
tSetViewport oSetViewport = NULL;

struct sDSGameFunctions
{
	DWORD DS_LandHitAddress;
};
sDSGameFunctions DSGameFunctions;


struct sSteamMatchmakingFunctions
{
	DWORD AddRequestLobbyListCompatibleMembersFilterAddress;
	DWORD AddRequestLobbyListDistanceFilterAddress;
	DWORD AddRequestLobbyListFilterSlotsAvailableAddress;
	DWORD AddRequestLobbyListNearValueFilterAddress;
	DWORD AddRequestLobbyListNumericalFilterAddress;
	DWORD AddRequestLobbyListResultCountFilterAddress;
	DWORD AddRequestLobbyListStringFilterAddress;
	DWORD CreateLobbyAddress;
	DWORD GetLobbyByIndexAddress;
	DWORD GetLobbyChatEntryAddress;
	DWORD GetLobbyDataAddress;
	DWORD GetLobbyDataByIndexAddress;
	DWORD GetLobbyMemberByIndexAddress;
	DWORD GetLobbyMemberDataAddress;
	DWORD GetNumLobbyMembersAddress;
	DWORD InviteUserToLobbyAddress;
	DWORD JoinLobbyAddress;
	DWORD LeaveLobbyAddress;
	DWORD RequestLobbyListAddress;
	DWORD SendLobbyChatMsgAddress;
	DWORD SetLobbyDataAddress;
	DWORD SetLobbyMemberDataAddress;
};
sSteamMatchmakingFunctions SteamMatchMakingFunctions;
enum SteamMatchmakingVTable
{
	GetFavoriteGameCount, // 0
	GetFavoriteGame, // 1
	AddFavoriteGame, // 2
	RemoveFavoriteGame, // 3
	RequestLobbyList, // 4
	AddRequestLobbyListStringFilter, // 5
	AddRequestLobbyListNumericalFilter, // 6
	AddRequestLobbyListNearValueFilter, // 7
	AddRequestLobbyListFilterSlotsAvailable, // 8
	AddRequestLobbyListDistanceFilter, // 9
	AddRequestLobbyListResultCountFilter, // 10
	AddRequestLobbyListCompatibleMembersFilter, // 11
	GetLobbyByIndex, // 12
	CreateLobby, // 13
	JoinLobby, // 14
	LeaveLobby, // 15
	InviteUserToLobby, // 16
	GetNumLobbyMembers, // 17
	GetLobbyMemberByIndex, // 18
	GetLobbyData, // 19
	SetLobbyData, // 20
	GetLobbyMemberData, // 21
	SetLobbyMemberData, // 22
	GetLobbyDataCount, // 23
	GetLobbyDataByIndex, // 24
	DeleteLobbyData, // 25
	SendLobbyChatMsg, // 26
	GetLobbyChatEntry, // 27
	RequestLobbyData, // 28
	SetLobbyGameServer, // 29
	GetLobbyGameServer, // 30
	SetLobbyMemberLimit, // 31
	GetLobbyMemberLimit, // 32
	SetLobbyVoiceEnabled, // 33
	RequestFriendsLobbies, // 34
	SetLobbyType, // 35
	SetLobbyJoinable, // 36
	GetLobbyOwner, // 37
	SetLobbyOwner, // 38
	SetLinkedLobby, // 39
	BeginGMSQuery, // 40
	PollGMSQuery, // 41
	GetGMSQueryResults, // 42
	ReleaseGMSQuery, // 43
	SendGameServerPingSample, // 44
	EnsureFavoriteGameAccountsUpdated // 45
};

struct sSteamNetworkingFunctions
{
	DWORD SendP2PPacketAddress;
	DWORD IsP2PPacketAvailableAddress;
	DWORD ReadP2PPacketAddress;
};
sSteamNetworkingFunctions SteamNetworkingFunctions;
enum SteamNetworkingVTable
{
	SendP2PPacket, // 0
	IsP2PPacketAvailable, // 1
	ReadP2PPacket, // 2
	AcceptP2PSessionWithUser, // 3
	CloseP2PSessionWithUser, // 4
	CloseP2PChannelWithUser, // 5
	GetP2PSessionState, // 6
	AllowP2PPacketRelay, // 7
	CreateListenSocket, // 8
	CreateP2PConnectionSocket, // 9 
	CreateConnectionSocket, // 10
	DestroySocket, // 11
	DestroyListenSocket, // 12
	SendDataOnSocket, // 13
	IsDataAvailableOnSocket, // 14
	RetrieveDataFromSocket, // 15
	IsDataAvailable, // 16
	RetrieveData, // 17
	GetSocketInfo, // 18
	GetListenSocketInfo, // 19
	GetSocketConnectionType, // 20
	GetMaxPacketSize // 21
};

struct sDXFunctions
{
	DWORD BeginSceneAddress;
	DWORD ColorFillAddress;
	DWORD CreateIndexBufferAddress;
	DWORD CreateRenderTargetAddress;
	DWORD CreateTextureAddress;
	DWORD CreateVertexBufferAddress;
	DWORD CreateVertexShaderAddress;
	DWORD DrawIndexedPrimitiveAddress;
	DWORD DrawIndexedPrimitiveUPAddress;
	DWORD DrawPrimitiveAddress;
	DWORD DrawPrimitiveUPAddress;
	DWORD EndSceneAddress;
	DWORD GetLightAddress;
	DWORD GetStreamSourceAddress;
	DWORD LightEnableAddress;
	DWORD ProcessVerticesAddress;
	DWORD ResetAddress;
	DWORD SetLightAddress;
	DWORD SetMaterialAddress;
	DWORD SetRenderStateAddress;
	DWORD SetStreamSourceAddress;
	DWORD SetTextureAddress;
	DWORD SetViewportAddress;
};
sDXFunctions DXFunctions;
enum DXVTable
{
	QueryInterface, // 0
	AddRef, // 1
	Release, // 2
	TestCooperativeLevel, // 3
	GetAvailableTextureMem, // 4
	EvictManagedResources, // 5
	GetDirect3D, // 6
	_GetDeviceCaps, // 7
	GetDisplayMode, // 8
	GetCreationParameters, // 9
	SetCursorProperties, // 10
	SetCursorPosition, // 11
	_ShowCursor, // 12
	CreateAdditionalSwapChain, // 13
	GetSwapChain, // 14
	GetNumberOfSwapChains, // 15
	Reset, // 16
	Present, // 17
	GetBackBuffer, // 18
	GetRasterStatus, // 19
	SetDialogBoxMode, // 20
	SetGammaRamp, // 21
	GetGammaRamp, // 22
	CreateTexture, // 23
	CreateVolumeTexture, // 24
	CreateCubeTexture, // 25
	CreateVertexBuffer, // 26
	CreateIndexBuffer, // 27
	CreateRenderTarget, // 28
	CreateDepthStencilSurface, // 29
	UpdateSurface, // 30
	UpdateTexture, // 31
	GetRenderTargetData, // 32
	GetFrontBufferData, // 33
	StretchRect, // 34
	ColorFill, // 35
	CreateOffscreenPlainSurface, // 36
	SetRenderTarget, // 37
	GetRenderTarget, // 38
	SetDepthStencilSurface, // 39
	GetDepthStencilSurface, // 40
	BeginScene, // 41
	EndScene, // 42
	Clear, // 43
	SetTransform, // 44
	GetTransform, // 45
	MultiplyTransform, // 46
	SetViewport, // 47
	GetViewport, // 48
	SetMaterial, // 49
	GetMaterial, // 50
	SetLight, // 51
	GetLight, // 52
	LightEnable, // 53
	GetLightEnable, // 54
	SetClipPlane, // 55
	GetClipPlane, // 56
	SetRenderState, // 57
	GetRenderState, // 58
	CreateStateBlock, // 59
	BeginStateBlock, // 60
	EndStateBlock, // 61
	SetClipStatus, // 62
	GetClipStatus, // 63
	GetTexture, // 64
	SetTexture, // 65
	GetTextureStageState, // 66
	SetTextureStageState, // 67
	GetSamplerState, // 68
	SetSamplerState, // 69
	ValidateDevice, // 70
	_SetPaletteEntries, // 71
	_GetPaletteEntries, // 72
	SetCurrentTexturePalette, // 73
	GetCurrentTexturePalette, // 74
	SetScissorRect, // 75
	GetScissorRect, // 76
	SetSoftwareVertexProcessing, // 77
	GetSoftwareVertexProcessing, // 78
	SetNPatchMode, // 79
	GetNPatchMode, // 80
	DrawPrimitive, // 81
	DrawIndexedPrimitive, // 82
	DrawPrimitiveUP, // 83
	DrawIndexedPrimitiveUP, // 84
	ProcessVertices, // 85
	CreateVertexDeclaration, // 86
	SetVertexDeclaration, // 87
	GetVertexDeclaration, // 88
	SetFVF, // 89
	GetFVF, // 90
	CreateVertexShader, // 91
	SetVertexShader, // 92
	GetVertexShader, // 93
	SetVertexShaderConstantF, // 94
	GetVertexShaderConstantF, // 95
	SetVertexShaderConstantI, // 96
	GetVertexShaderConstantI, // 97
	SetVertexShaderConstantB, // 98
	GetVertexShaderConstantB, // 99
	SetStreamSource, // 100
	GetStreamSource, // 101
	SetStreamSourceFreq, // 102
	GetStreamSourceFreq, // 103
	SetIndices, // 104
	GetIndices, // 105
	CreatePixelShader, // 106
	SetPixelShader, // 107
	GetPixelShader, // 108
	SetPixelShaderConstantF, // 109
	GetPixelShaderConstantF, // 110
	SetPixelShaderConstantI, // 111
	GetPixelShaderConstantI, // 112
	SetPixelShaderConstantB, // 113
	GetPixelShaderConstantB, // 114
	DrawRectPatch, // 115
	DrawTriPatch, // 116
	DeletePatch, // 117
	CreateQuery // 118
};

struct PacketData
{
	byte bytes[512];
};
struct charPos
{
	unsigned int unk1;
	float facing;				//0x0004
	BYTE unk2[0x8];
	float xPos;					//0x0010
	float yPos;					//0x0014
	float zPos;					//0x0018
};
struct charLocData
{
	BYTE unk1[0x1C];
	charPos *pos;				//0x001C
};
struct creatureData2
{
	
};
struct creatureData1
{
	BYTE unk1[0x28];
	charLocData *loc;			//0x0028
	BYTE unk2[0xC];
	wchar_t modelName[0x8];		//0x0038
	BYTE unk3[0x20];
	int NPCID;					//0x0068
	BYTE unk4[0x4];
	int PhantomType;			//0x0070
	int TeamType;				//0x0074
	BYTE unk5[0x148];
	float currPoise;			//0x01C0
	float maxPoise;				//0x01C4
	BYTE unk5a[0x4];
	float poiseRecoveryTimer;	//0x01CC
	BYTE unk6[0x104];
	int currHP;					//0x02D4
	int maxHP;					//0x02D8
	BYTE unk7[0x8];
	int currStam;				//0x02E4
	int maxStam;				//0x02E8
	BYTE unk8[0x14];
	int currentPoisonResist;	//0x0300
	int currentToxicResist;		//0x0304
	int currentBleedResist;		//0x0308
	int currentCurseResist;		//0x030C
	int maxPoisonResist;		//0x0310
	int maxToxicResist;			//0x0314
	int maxBleedResist;			//0x0318
	int maxCurseResist;			//0x031C
	BYTE unk9[0xF4];
	creatureData2 *cdata2;		//0x0414
	BYTE unk10[0x4];
	int AIID;					//0x041C
};



struct LoadedCreatures
{
	PVOID pUnknown;             // 0x137DC70
	creatureData1 *firstCreature;    // +4
	creatureData1 *lastCreature;     // +8
};




//In-Game Function Hooks
void __stdcall hDS_LandHit(UINT *atkChar, float *dmg, UINT unk)
{
	UINT *defChar = NULL;

	__asm {
		mov defChar, eax
		push eax
	}


	if (!(defChar == lastenemy) && !(defChar == chardata1) && defChar)
		lastenemy = defChar;
	
	
	creatureData1 *atk = (creatureData1*)atkChar;
	creatureData1 *def = (creatureData1*)defChar;


	for (int i = 0; i < 4; i++)
	{
		lastAtk[i] = lastAtk[i + 1];
		lastDef[i] = lastDef[i + 1];
		lastDmg[i] = lastDmg[i + 1];
	}
	

	if (atkChar && defChar)
	{
		lastAtk[4] = *(wstring*)&atk->modelName;
		lastDef[4] = *(wstring*)&def->modelName;
		lastDmg[4] = (float)(*dmg);
	}


	__asm {
		pop eax
	}
	oDS_LandHit(atkChar, dmg, unk);
}


//Steam Matchmaking Hooks
